#include <iostream>

using namespace std;

// Напишіть програму, яка оголошує константний вказівник на постійне ціле значення.
// Ініціалізуйте цей вказівник, щоб він вказав на цілісну змінну varOne.
// Надайте змінній varOne значення 6. Використовуйте вказівник, щоб, присвоїти змінній varOne значення 7.
// Створіть другу цілочисленну змінну varTwo. Перепризначте вказівник, щоб він вказував на змінну varTwo. Поки не компілюйте цю вправу.

int main()
{
    int varOne;
    const int* pConstVar = &varOne;
    varOne = 6;
    *pConstVar = 7;
    int varTwo;
    pConstVar = &varTwo;

    return 0;
}

// 3. Скомпілюйте програму, написану у вправі 2. Які дії компілятор вважає помилковими? Які рядки генерують попередження?
// - компілятор вважає помилкою спробу змінити значення за адресою, яку утримує вказівник, оскільки він об'явлений константою. Генерує відповідну помилку в рядку 15;