#include <iostream>

using namespace std;

// 1. Оголосіть двомірний масив, який представляє поле для ірги в хрестики і нулики.
// 2. Запишіть програмний код, який ініціалізує значенням 0 всі елементи створеного перед цим масиву.

int main()
{
    char TicTacToe[3][3] = { 
        {'0', '0', '0'}, 
        {'0', '0', '0'}, 
        {'0', '0', '0'} 
    }; // Завдання 1-2, використав char для реалістичної репрезентації гри 

    for(int i = 0; i < 3; i++)
    {
        for(int j = 0; j < 3; j++)
        {
            cout << TicTacToe[i][j] << " ";
        }
        cout << "\n";
    }

    return 0;
}